import random
M = random.randrange(1,13)
d = {'С' : 'Север', 'З' : 'Запад', 'Ю' : 'Юг', 'B' : 'Восток'}
r = {-1 : "поворот направо", 0 : "продолжать движение", 1 : "поворот налево"}
d1 = {0 : 'С', 1: 'З',  2 : 'Ю', 3 : 'B'}
try:
    i = random.randrange(0,4)
    C = d[d1[i]]
    print("Исходное направление (C) : ", C)
    N = random.randrange(-1,2)
    print("Команда (N) : ", N)
    print("Поворот: ", r[N])
    if N == -1:
        print("Part -1")
        if i == 0:
            i = 3
        elif i == 3:
            i = 2
        elif i == 2:
            i = 1
        elif i == 1:
            i == 0
    elif N == 1:
        if i == 0:
            i = 1
        elif i == 1:
            i = 2
        elif i == 2:
            i = 3
        elif i == 3:
            d1 = 0
    C = d[d1[i]]
    print("Новое направление (C) : ", C)
except KeyError as e:
    print('Ошибка')
print('')
dcat = {
    11 : 'одиннадцать',
    12 : 'двенадцать',
    13 : 'тринадцать',
    14 : 'четырнадцать',
    15 : 'пятнадцать',
    16 : 'шестнадцать',
    17 : 'семнадцать',
    18 : 'восемнадцать',
    19 : 'девятнадцать',
}

desyatki = {
    10 : 'десять',
    20 : 'двадцать',
    30 : 'тридцать',
    40 : 'сорок'
}

edinici  = {
    1 : 'одно учебное задание',
    2 : 'два учебных задания',
    3 : 'три учебных задания',
    4 : 'четыре учебных задания',
    5 : 'пять учебных заданий',
    6 : 'шесть учебных заданий',
    7 : 'семь учебных заданий',
    8 : 'восемь учебных заданий',
    9 : 'девять учебных заданий'
}

try:
    N = random.randrange(10,41)
    print("N = ",N)
    if 10 < N and N < 20:
        print("{0} учебных заданий".format(dcat[N]))
    else:
        w = N%10
        print("w = ",w)
        if w == 0:
            print("{0} учебных заданий".format(desyatki[N]))
        else:
            q = int(N/10)*10
            print("q = ",q)
            print("{0} {1}".format(desyatki[q], edinici[w]))

except KeyError as e:
    print('Ошибка')
print('')
edinici  = {
    1 : 'один',
    2 : 'два',
    3 : 'три',
    4 : 'четыре',
    5 : 'пять',
    6 : 'шесть',
    7 : 'семь',
    8 : 'восемь',
    9 : 'девять'
}
dcat = {
    11 : 'одиннадцать',
    12 : 'двенадцать',
    13 : 'тринадцать',
    14 : 'четырнадцать',
    15 : 'пятнадцать',
    16 : 'шестнадцать',
    17 : 'семнадцать',
    18 : 'восемнадцать',
    19 : 'девятнадцать',
}
desyatki = {
    10 : 'десять',
    20 : 'двадцать',
    30 : 'тридцать',
    40 : 'сорок',
    50 : 'пятьдесят',
    60 : 'шестьдесят',
    70 : 'семьдесят',
    80 : 'восемьдесят',
    90 : 'девяносто',
}
sotni = {
    100 : 'сто',
    200 : 'двести',
    300 : 'триста',
    400 : 'четыреста',
    500 : 'пятьсот',
    600 : 'шестьсот',
    700 : 'семьсот',
    800 : 'восемьсот',
    900 : 'девятьсот',
}
try:
    A = random.randrange(100,999)
    propis = ''
    print("A = ",A)
    v = int(A/100)*100
    propis += sotni[v]
    A -= v
    if 10 < A and A < 20:
        propis += ' ' + dcat[A]
    else:
        ro = A%10
        v = int(A/10)*10
        if v !=0:
            propis += ' ' + desyatki[v]
        if ro != 0:
            propis += ' ' + edinici[ro]
    print(propis)
except KeyError as e:
    print('Ошибка',e)
print('')
title  = {
    1 : 'крысы',
    2 : 'коровы',
    3 : 'тигра',
    4 : 'зайца',
    5 : 'дракона',
    6 : 'змеи',
    7 : 'лошади',
    8 : 'овцы',
    9 : 'обезьяны',
    10 : 'курицы',
    11 : 'собаки',
    12 : 'свиньи'
}
color = {
    0 : {
        1 : 'зеленой',
        2 : 'красной',
        3 : 'желтой',
        4 : 'белой',
        5 : 'черной'
    },
    1 : {
        1 : 'зеленого',
        2 : 'красного',
        3 : 'желтого',
        4 : 'белого',
        5 : 'черного'
    }
}
No = random.randrange(1900,2222)
No = 1932
No = 1976
print("Год:",No)
year_name = 'Год '
title_code = (No - 4) % 12 + 1
print("Title code: ", title_code)
print("Title: ", title[title_code])
io = 0
if title_code in [3,4,5]:
    io = 1
color_code = (No - 4) % 10 + 1
color_code = int((color_code - 1) / 2) + 1
print("Color code: ", color_code)
print("Color: ", color[io][color_code])
year_name += color[io][color_code] + ' ' + title[title_code]
print(year_name)
